; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_12)

(:domain logistics)

(:objects
	obj0 obj2 obj6 - airport
	obj1 obj3 obj7 - city
	obj4 obj5 obj8 obj9 - truck
	obj10 obj12 obj14 obj16 obj19 obj20 - package
	obj11 obj13 obj15 obj18 obj21 - location
	obj17 obj22 - airplane
)

(:init
	(at obj4 obj0)
	(at obj5 obj2)
	(at obj8 obj6)
	(at obj9 obj6)
	(at obj10 obj0)
	(at obj12 obj2)
	(at obj14 obj6)
	(at obj16 obj11)
	(at obj17 obj6)
	(at obj19 obj6)
	(at obj20 obj6)
	(at obj22 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj6 obj7)
	(in-city obj11 obj1)
	(in-city obj13 obj7)
	(in-city obj15 obj3)
	(in-city obj18 obj3)
	(in-city obj21 obj7)
)

(:goal (and
	(at obj10 obj21)
	(at obj12 obj13)
	(at obj14 obj11)
	(at obj16 obj0)
	(at obj19 obj11)
	(at obj20 obj11)
))
)

; plan
1. (drive obj4 obj0 obj11)
   deleted: (at obj4 obj0)
   added: (at obj4 obj11)
   goals met: 0 of 6
2. (drive obj5 obj2 obj15)
   deleted: (at obj5 obj2)
   added: (at obj5 obj15)
   goals met: 0 of 6
3. (drive obj8 obj6 obj13)
   deleted: (at obj8 obj6)
   added: (at obj8 obj13)
   goals met: 0 of 6
4. (drive obj9 obj6 obj13)
   deleted: (at obj9 obj6)
   added: (at obj9 obj13)
   goals met: 0 of 6
5. (load obj17 obj14 obj6)
   deleted: (at obj14 obj6)
   added: (in obj14 obj17)
   goals met: 0 of 6
6. (load obj17 obj19 obj6)
   deleted: (at obj19 obj6)
   added: (in obj19 obj17)
   goals met: 0 of 6
7. (load obj17 obj20 obj6)
   deleted: (at obj20 obj6)
   added: (in obj20 obj17)
   goals met: 0 of 6
8. (load obj22 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj22)
   goals met: 0 of 6
9. (fly obj17 obj6 obj0)
   deleted: (at obj17 obj6)
   added: (at obj17 obj0)
   goals met: 0 of 6
10. (fly obj22 obj0 obj2)
   deleted: (at obj22 obj0)
   added: (at obj22 obj2)
   goals met: 0 of 6
11. (drive obj9 obj13 obj21)
   deleted: (at obj9 obj13)
   added: (at obj9 obj21)
   goals met: 0 of 6
12. (load obj22 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj22)
   goals met: 0 of 6
13. (fly obj22 obj2 obj6)
   deleted: (at obj22 obj2)
   added: (at obj22 obj6)
   goals met: 0 of 6
14. (drive obj8 obj13 obj6)
   deleted: (at obj8 obj13)
   added: (at obj8 obj6)
   goals met: 0 of 6
15. (drive obj9 obj21 obj6)
   deleted: (at obj9 obj21)
   added: (at obj9 obj6)
   goals met: 0 of 6
16. (load obj4 obj16 obj11)
   deleted: (at obj16 obj11)
   added: (in obj16 obj4)
   goals met: 0 of 6
17. (unload obj17 obj14 obj0)
   deleted: (in obj14 obj17)
   added: (at obj14 obj0)
   goals met: 0 of 6
18. (unload obj17 obj19 obj0)
   deleted: (in obj19 obj17)
   added: (at obj19 obj0)
   goals met: 0 of 6
19. (unload obj17 obj20 obj0)
   deleted: (in obj20 obj17)
   added: (at obj20 obj0)
   goals met: 0 of 6
20. (unload obj22 obj10 obj6)
   deleted: (in obj10 obj22)
   added: (at obj10 obj6)
   goals met: 0 of 6
21. (unload obj22 obj12 obj6)
   deleted: (in obj12 obj22)
   added: (at obj12 obj6)
   goals met: 0 of 6
22. (drive obj4 obj11 obj0)
   deleted: (at obj4 obj11)
   added: (at obj4 obj0)
   goals met: 0 of 6
23. (drive obj5 obj15 obj2)
   deleted: (at obj5 obj15)
   added: (at obj5 obj2)
   goals met: 0 of 6
24. (fly obj22 obj6 obj2)
   deleted: (at obj22 obj6)
   added: (at obj22 obj2)
   goals met: 0 of 6
25. (load obj4 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj4)
   goals met: 0 of 6
26. (load obj4 obj19 obj0)
   deleted: (at obj19 obj0)
   added: (in obj19 obj4)
   goals met: 0 of 6
27. (load obj4 obj20 obj0)
   deleted: (at obj20 obj0)
   added: (in obj20 obj4)
   goals met: 0 of 6
28. (load obj8 obj12 obj6)
   deleted: (at obj12 obj6)
   added: (in obj12 obj8)
   goals met: 0 of 6
29. (load obj9 obj10 obj6)
   deleted: (at obj10 obj6)
   added: (in obj10 obj9)
   goals met: 0 of 6
30. (unload obj4 obj16 obj0)
   deleted: (in obj16 obj4)
   added: (at obj16 obj0)
   goals met: 1 of 6
31. (drive obj4 obj0 obj11)
   deleted: (at obj4 obj0)
   added: (at obj4 obj11)
   goals met: 1 of 6
32. (drive obj8 obj6 obj13)
   deleted: (at obj8 obj6)
   added: (at obj8 obj13)
   goals met: 1 of 6
33. (drive obj9 obj6 obj21)
   deleted: (at obj9 obj6)
   added: (at obj9 obj21)
   goals met: 1 of 6
34. (drive obj5 obj2 obj18)
   deleted: (at obj5 obj2)
   added: (at obj5 obj18)
   goals met: 1 of 6
35. (fly obj22 obj2 obj0)
   deleted: (at obj22 obj2)
   added: (at obj22 obj0)
   goals met: 1 of 6
36. (unload obj4 obj14 obj11)
   deleted: (in obj14 obj4)
   added: (at obj14 obj11)
   goals met: 2 of 6
37. (unload obj4 obj19 obj11)
   deleted: (in obj19 obj4)
   added: (at obj19 obj11)
   goals met: 3 of 6
38. (unload obj4 obj20 obj11)
   deleted: (in obj20 obj4)
   added: (at obj20 obj11)
   goals met: 4 of 6
39. (unload obj8 obj12 obj13)
   deleted: (in obj12 obj8)
   added: (at obj12 obj13)
   goals met: 5 of 6
40. (unload obj9 obj10 obj21)
   deleted: (in obj10 obj9)
   added: (at obj10 obj21)
   goals met: 6 of 6
